# StairstypeGeomunjoinedEndCutStyle Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..StairstypeGeomunjoinedEndCutStyle Property
ParameterTypeId Class See Also
---
"Connection Method": Cut Style for Geometrically Unjoined End
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId StairstypeGeomunjoinedEndCutStyle { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property StairstypeGeomunjoinedEndCutStyle As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ StairstypeGeomunjoinedEndCutStyle {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace